# How to do the connection with your __SQL__ ?

In [1]:
import mysql.connector as conn

In [8]:
db = conn.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225'
)

In [3]:
my_cursor = db.cursor()

In [4]:
my_cursor.execute("CREATE DATABASE sales")

In [5]:
my_cursor.execute('SHOW DATABASES')

In [6]:
for x in my_cursor:
    print(x)

('database1',)
('girrafe',)
('information_schema',)
('mysql',)
('performance_schema',)
('sales',)
('sys',)

In [7]:
db.commit()

## How to connect to any of your __databases__ ?

In [42]:
db = conn.connect(
host ='localhost',
user = 'root',
password = 'Assie@225',
database ='girrafe'    
)

In [11]:
new_cusor = db.cursor()

In [36]:
new_cusor.execute('SELECT *FROM Employee')

In [37]:
for x in new_cusor :
    print(x)

(100, 'David', 'wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1)
(101, 'Jan', 'Levison', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, None, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, None, 2)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, None, 2)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(108, 'Jim', 'Halpert', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)
(109, 'Oscar', 'Martinez', datetime.date(1968, 2, 19), 'M', 69000, 106, 3)
(110, 'Oliver', 'Assie', datetime.date(1997, 11, 18), 'M', 250000, 106, 3)
(111, 'Jackson', 'Brou', datetime.date(1995, 11, 11), 'M', 250000, 106, 2)
(112, 'Yao', 'One love', datetime.date(1986, 11, 11), 'M', 255000, 106, 3)
(113, 'Aya', 'One love', datetime.date(1994, 11, 11), 'F', 255000, 106, 3)
(114, 'Sanogo', 'One love', datetime.date(1999, 5, 11), 'F', 255000, 106, 2)

# How to import data from __MySQL__ ?

In [45]:
import pandas as pd
import numpy as np 
import mysql.connector as conn

In [46]:

db = conn.connect(
host ='localhost',
user = 'root',
password = 'Assie@225',
database ='girrafe'    
)

In [43]:
data = pd.read_sql_query('SELECT *FROM Employee',db)

In [44]:
data

    emp_id first_name last_name  birth_date sex  salary  super_id  branch_id
0      100      David   wallace  1967-11-17   M  250000       NaN          1
1      101        Jan   Levison  1961-05-11   F  110000     100.0          1
2      103     Angela    Martin  1971-06-25   F   63000       NaN          2
3      104      Kelly    Kapoor  1980-02-05   F   55000       NaN          2
4      105    Stanley    Hudson  1958-02-19   M   69000       NaN          2
5      106       Josh    Porter  1969-09-05   M   78000     100.0          3
6      107       Andy   Bernard  1973-07-22   M   65000     106.0          3
7      108        Jim   Halpert  1978-10-01   M   71000     106.0          3
8      109      Oscar  Martinez  1968-02-19   M   69000     106.0          3
9      110     Oliver     Assie  1997-11-18   M  250000     106.0          3
10     111    Jackson      Brou  1995-11-11   M  250000     106.0          2
11     112        Yao  One love  1986-11-11   M  255000     106.0          3
12     113        Aya  One love  1994-11-11   F  255000     106.0          3
13     114     Sanogo  One love  1999-05-11   F  255000     106.0          2

In [47]:
names = data[['first_name','last_name']]

In [51]:
names.loc[13]

first_name      Sanogo
last_name     One love
Name: 13, dtype: object

# How to see the __database infos__, tables and the diferents __constraints__ ???

In [52]:
info = pd.read_sql_query('SHOW TABLES FROM girrafe',db)

In [53]:
info

  Tables_in_girrafe
0            branch
1   branch_supplier
2            client
3          Employee
4          purchase
5      trigger_test
6         work_with

In [54]:
tables = info['Tables_in_girrafe']

In [59]:
for table_name in tables:
    output = pd.read_sql_query('DESC {}'.format(table_name),db)
    print(table_name)
    print(output,'_'*15,'\n')

branch
            Field            Type Null  Key Default Extra
0       branch_id          b'int'   NO  PRI    None
1     branch_name  b'varchar(40)'  YES         None
2          mgr_id          b'int'  YES  MUL    None
3  mgr_start_date         b'date'  YES         None       _______________

branch_supplier
           Field            Type Null  Key Default Extra
0      branch_id          b'int'   NO  PRI    None
1  supplier_name  b'varchar(40)'   NO  PRI    None
2    supply_type  b'varchar(40)'  YES         None       _______________

client
         Field            Type Null  Key Default Extra
0    client_id          b'int'   NO  PRI    None
1  client_name  b'varchar(40)'  YES         None
2    branch_id          b'int'  YES  MUL    None       _______________

Employee
        Field            Type Null  Key Default Extra
0      emp_id          b'int'   NO  PRI    None
1  first_name  b'varchar(40)'  YES         None
2   last_name  b'varchar(40)'  YES         None
3  birth_date         b'date'  YES         None
4         sex   b'varchar(1)'  YES         None
5      salary          b'int'  YES         None
6    super_id          b'int'  YES  MUL    None
7   branch_id          b'int'  YES  MUL    None       _______________

purchase
              Field     Type Null Key Default Extra
0                id   b'int'  YES        None
1  date_of_purchase  b'date'  YES        None       _______________

trigger_test
     Field             Type Null Key Default Extra
0  message  b'varchar(100)'  YES        None       _______________

work_with
         Field    Type Null  Key Default Extra
0       emp_id  b'int'   NO  PRI    None
1    client_id  b'int'   NO  PRI    None
2  total_sales  b'int'  YES         None       _______________

## Checking of employees Database

In [60]:
import pandas as pd
import numpy as np 
import mysql.connector as conn

In [61]:
db = conn.connect(
host ='localhost',
user = 'root',    
password = 'Assie@225',
database = 'employees'    
)

In [62]:
my_cursor = db.cursor()

In [63]:
my_cursor.execute('SHOW TABLES')

In [64]:
for x in my_cursor:
    print(x)

('current_dept_emp',)
('departments',)
('dept_emp',)
('dept_emp_latest_date',)
('dept_manager',)
('employees',)
('salaries',)
('titles',)

### To see the  table __employees__ from __employees database__

In [69]:


df = pd.read_sql_query('SELECT *FROM employees',db)

In [70]:
df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [71]:
employees_names = df[['first_name','last_name']]

In [72]:
employees_names

       first_name last_name
0          Georgi   Facello
1         Bezalel    Simmel
2           Parto   Bamford
3       Chirstian   Koblick
4         Kyoichi  Maliniak
...           ...       ...
300019     Dekang  Lichtner
300020       Zito      Baaz
300021    Berhard    Lenart
300022   Patricia   Breugel
300023     Sachin   Tsukuda

[300024 rows x 2 columns]

In [74]:
## employees_names.to_csv('employees_names.csv')

## How to check the database structure

## To see all the  __tables__  from employees database and more __details__ about their __structures__

In [76]:
info1 = pd.read_sql_query('SHOW TABLES FROM employees',db)

In [77]:
info1

    Tables_in_employees
0      current_dept_emp
1           departments
2              dept_emp
3  dept_emp_latest_date
4          dept_manager
5             employees
6              salaries
7                titles

In [78]:
tables = info1['Tables_in_employees']

In [79]:
for table in tables:
    output = pd.read_sql_query('DESC {}'.format(table),db)
    print(table)
    print(output,'\n')

current_dept_emp
       Field        Type Null Key Default Extra
0     emp_no      b'int'   NO        None
1    dept_no  b'char(4)'   NO        None
2  from_date     b'date'  YES        None
3    to_date     b'date'  YES        None

departments
       Field            Type Null  Key Default Extra
0    dept_no      b'char(4)'   NO  PRI    None
1  dept_name  b'varchar(40)'   NO  UNI    None

dept_emp
       Field        Type Null  Key Default Extra
0     emp_no      b'int'   NO  PRI    None
1    dept_no  b'char(4)'   NO  PRI    None
2  from_date     b'date'   NO         None
3    to_date     b'date'   NO         None

dept_emp_latest_date
       Field     Type Null Key Default Extra
0     emp_no   b'int'   NO        None
1  from_date  b'date'  YES        None
2    to_date  b'date'  YES        None

dept_manager
       Field        Type Null  Key Default Extra
0     emp_no      b'int'   NO  PRI    None
1    dept_no  b'char(4)'   NO  PRI    None
2  from_date     b'date'   NO         None
3    to_date     b'date'   NO         None

employees
        Field              Type Null  Key Default Extra
0      emp_no            b'int'   NO  PRI    None
1  birth_date           b'date'   NO         None
2  first_name    b'varchar(14)'   NO         None
3   last_name    b'varchar(16)'   NO         None
4      gender  b"enum('M','F')"   NO         None
5   hire_date           b'date'   NO         None

salaries
       Field     Type Null  Key Default Extra
0     emp_no   b'int'   NO  PRI    None
1     salary   b'int'   NO         None
2  from_date  b'date'   NO  PRI    None
3    to_date  b'date'   NO         None

titles
       Field            Type Null  Key Default Extra
0     emp_no          b'int'   NO  PRI    None
1      title  b'varchar(50)'   NO  PRI    None
2  from_date         b'date'   NO  PRI    None
3    to_date         b'date'  YES         None

In [80]:
pwd

'/Users/olivierla412/projects/DataTrained_live_classes'